
#include "define.h"
//gplibの名前空間を省略＝入力短縮のため
//外部のライブラリの場合は名前重複の恐れがあるため、消すこと。
using namespace gplib;
//**************************************************************************************//
//作成するプログラムで必要となる変数、定数定義
//**************************************************************************************//


//**************************************************************************************//
//関数記述
//**************************************************************************************//

//======================================================================================//
//デフォルト関数定義
//======================================================================================//

//---------------------------------
// Title
//---------------------------------
//初期化処理		
void TitleInit()
{
}

//フレーム処理
void TitleStep()
{
  if (input::CheckPush(input::KEY_BTN0))
  {
    stage::ChangeStage(STAGE1SCENE);
  }
}

//描画処理
void TitleDisp()
{
	font::Draw_FontText(10, 100, 0.f, "防衛シューティング Aキーで開始", ARGB(255, 255, 0, 0), 0);
}

void Title()
{
  if (gplib::stage::InitStage()){ TitleInit(); }
  TitleStep();
  TitleDisp();
}



